tutorials/verificationAndValidation/radiation-delete/2-infinite-cylinder-Cai-Modest-2016/3-axial-azimuthal-symmetry/setups.orig/common/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

runApplication createPatch -overwrite

restore0Dir

runApplication $(getApplication)

#------------------------------------------------------------------------------
